{"index":{"title":"index","links":[],"tags":[],"content":"Hi vicky"},"notes/2025/AI_AUTOMATION":{"title":"AI_AUTOMATION","links":[],"tags":[],"content":"LEARN AI AUTOMATION WITH PLAYWRIGHT\nINSTALLNATION:\n\nOpen vs code\nnpm init playwright@latest\nChoose between TypeScript or JavaScript (default is TypeScript)\nName of your Tests folder (default is tests or e2e if you already have a tests folder in your project)\nAdd a GitHub Actions workflow to easily run tests on CI\nInstall Playwright browsers (default is true)\nTo run the Playwright npx playwright test(this will run all test)\nTo run specfic test npx playwright test —spec path\nTo show report npx playwright show-report\nTo run playwright using ui mode npx playwright test —ui\nTo run run code with specific browser npx playwright test —project=chromium\nTo run test in dubug mode npx playwright test —debug\nTo run test in auto generate mode npx playwright codegen\nTo update latest version of playwright npm install -D @playwright/test@latest and install latest binaries of browsers\r\nnpx playwright install —with-deps\n\nSystem requirements​\n\nLatest version of Node.js 18, 20 or 22.\nWindows 10+, Windows Server 2016+ or Windows Subsystem for Linux (WSL).\nmacOS 14 Ventura, or later.\nDebian 12, Ubuntu 22.04, Ubuntu 24.04, on x86-64 and arm64 architecture.\n\nBrowse Use Setup\r\ngithub.com/browser-use/browser-use#\n1.To use browse Use should have python above version 3.11\r\n2.While install if seen any issue like unable each modules of each version then use below commad\r\nIf you are using a virtual environment or have specific Python versions, you might need to use python -m pip install --upgrade pip to ensure you’re upgrading the correct pip.\r\npython3.11 -m pip install —upgrade pip\r\n3. To install browse use with correct version python3.11 -m pip install browser-use"},"notes/2025/DEVOPS":{"title":"DEVOPS","links":[],"tags":[],"content":"\n\n\n\n\n\n\n\n"},"notes/2025/MCP-SERCER":{"title":"MCP SERCER","links":[],"tags":[],"content":"MCP Server\r\nThe full form of MCP server, in the context of AI and large language models, is Model Context Protocol server. It acts as a standardized way for AI models to connect with external tools, systems, and data sources.\r\nINSTALLNATIOM"},"notes/2025/SSH-KEY-GENERATION-AND-UPDATATIONS":{"title":"SSH KEY GENERATION AND UPDATATIONS","links":[],"tags":[],"content":"HELLOS"},"projects/index":{"title":"Projects","links":[],"tags":[],"content":"Over the years, I’ve worked on a wide range of projects — from weekend experiments to solutions for real-world problems. Here’s a curated list of some of my favorites:"},"tags/genrative_ai":{"title":"genrative_ai","links":[],"tags":[],"content":""}}